//
//  CityLocation.swift
//  ClimaWeather
//
//  Created by 刘峥炫 on 2022/8/16.
//

import Foundation

//用于地址搜索
class CityLocation:ObservableObject {
    var CityNames = ["北京市","天津市","石家庄市","辛集市","晋州市","新乐市","唐山市","唐山市","唐山市","遵化市","迁安市","秦皇岛市","秦皇岛市","邯郸市","武安市","邢台市","南宫市","沙河市","保定市","涿州市","定州市","安国市","高碑店市","张家口市","张家口市","张家口市","张家口市","承德市","平泉市","沧州市","泊头市","任丘市","黄骅市","河间市","廊坊市","三河市","衡水市","深州市","太原市","古交市","大同市","阳泉市","长治市","潞城市","晋城市","高平市","朔州市","晋中市","介休市","运城市","永济市","河津市","忻州市","原平市","临汾市","侯马市","霍州市","吕梁市","孝义市","汾阳市","呼和浩特市","包头市","乌海市","赤峰市","通辽市","霍林郭勒市","鄂尔多斯市","呼伦贝尔市","满洲里市","牙克石市","扎兰屯市","额尔古纳市","根河市","巴彦淖尔市","乌兰察布市","丰镇市","乌兰浩特市","阿尔山市","二连浩特市","锡林浩特市","沈阳市","新民市","大连市","瓦房店市","庄河市","鞍山市","海城市","抚顺市","本溪市","丹东市","东港市","凤城市","锦州市","凌海市","北镇市","营口市","西市","盖州市","大石桥市","阜新市","辽阳市","灯塔市","盘锦市","铁岭市","调兵山市","开原市","朝阳市","北票市","凌源市","葫芦岛市","兴城市","长春市","榆树市","德惠市","吉林市","蛟河市","桦甸市","舒兰市","磐石市","四平市","公主岭市","双辽市","辽源市","通化市","梅河口市","集安市","白山市","临江市","松原市","扶余市","白城市","洮南市","大安市","延吉市","图们市","敦化市","珲春市","龙井市","和龙市","哈尔滨市","尚志市","五常市","齐齐哈尔市","讷河市","鸡西市","虎林市","密山市","鹤岗市","双鸭山市","大庆市","伊春市","铁力市","佳木斯市","同江市","富锦市","抚远市","七台河市","牡丹江市","绥芬河市","海林市","宁安市","穆棱市","东宁市","黑河市","北安市","五大连池市","绥化市","安达市","肇东市","海伦市","上海市","南京市","无锡市","江阴市","宜兴市","徐州市","新沂市","邳州市","常州市","溧阳市","苏州市","常熟市","张家港市","昆山市","太仓市","南通市","启东市","如皋市","海门市","连云港市","淮安市","盐城市","东台市","扬州市","仪征市","高邮市","镇江市","丹阳市","扬中市","句容市","泰州市","兴化市","靖江市","泰兴市","宿迁市","杭州市","建德市","宁波市","余姚市","慈溪市","温州市","瑞安市","乐清市","嘉兴市","海宁市","平湖市","桐乡市","湖州市","绍兴市","诸暨市","嵊州市","金华市","兰溪市","义乌市","东阳市","永康市","衢州市","江山市","舟山市","台州市","温岭市","临海市","玉环市","丽水市","龙泉市","合肥市","巢湖市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","桐城市","黄山市","滁州市","天长市","明光市","阜阳市","界首市","宿州市","六安市","亳州市","池州市","宣城市","宣城市","宁国市","福州市","福清市","长乐市","厦门市","莆田市","三明市","永安市","泉州市","石狮市","晋江市","南安市","漳州市","龙海市","南平市","邵武市","武夷山市","建瓯市","龙岩市","漳平市","宁德市","福安市","福鼎市","南昌市","景德镇市","乐平市","萍乡市","九江市","瑞昌市","共青城市","庐山市","新余市","鹰潭市","贵溪市","赣州市","瑞金市","吉安市","井冈山市","宜春市","丰城市","樟树市","高安市","抚州市","上饶市","德兴市","济南市","青岛市","胶州市","平度市","莱西市","淄博市","枣庄市","滕州市","东营市","烟台市","龙口市","莱阳市","莱州市","蓬莱市","招远市","栖霞市","海阳市","潍坊市","青州市","诸城市","寿光市","安丘市","高密市","昌邑市","济宁市","曲阜市","邹城市","泰安市","新泰市","肥城市","威海市","荣成市","乳山市","日照市","莱芜市","临沂市","德州市","乐陵市","禹城市","聊城市","临清市","滨州市","菏泽市","郑州市","巩义市","荥阳市","新密市","新郑市","登封市","开封市","洛阳市","偃师市","平顶山市","平顶山市","舞钢市","汝州市","安阳市","林州市","鹤壁市","新乡市","新乡市","卫辉市","辉县市","焦作市","沁阳市","孟州市","濮阳市","许昌市","禹州市","长葛市","漯河市","三门峡市","义马市","灵宝市","南阳市","南阳市","邓州市","商丘市","永城市","信阳市","周口市","项城市","驻马店市","济源市","武汉市","黄石市","大冶市","十堰市","丹江口市","宜昌市","宜都市","当阳市","枝江市","襄阳市","老河口市","枣阳市","宜城市","鄂州市","荆门市","钟祥市","孝感市","应城市","安陆市","汉川市","荆州市","沙市","石首市","洪湖市","松滋市","黄冈市","麻城市","武穴市","咸宁市","赤壁市","随州市","广水市","恩施市","利川市","仙桃市","潜江市","天门市","长沙市","浏阳市","宁乡市","株洲市","醴陵市","湘潭市","湘乡市","韶山市","衡阳市","耒阳市","常宁市","邵阳市","武冈市","岳阳市","岳阳市","汨罗市","临湘市","常德市","津市市","张家界市","益阳市","益阳市","沅江市","郴州市","资兴市","永州市","永州市","永州市","怀化市","洪江市","娄底市","冷水江市","涟源市","吉首市","广州市","韶关市","乐昌市","南雄市","深圳市","珠海市","汕头市","佛山市","江门市","台山市","开平市","鹤山市","恩平市","湛江市","廉江市","雷州市","吴川市","茂名市","高州市","化州市","信宜市","肇庆市","四会市","惠州市","梅州市","兴宁市","汕尾市","陆丰市","河源市","阳江市","阳春市","清远市","英德市","连州市","东莞市","中山市","潮州市","揭阳市","普宁市","云浮市","罗定市","南宁市","柳州市","桂林市","梧州市","岑溪市","北海市","防城港市","东兴市","钦州市","贵港市","桂平市","玉林市","北流市","百色市","靖西市","贺州市","河池市","来宾市","合山市","崇左市","凭祥市","海口市","三亚市","三沙市","儋州市","五指山市","琼海市","文昌市","万宁市","东方市","重庆市","成都市","都江堰市","彭州市","邛崃市","崇州市","简阳市","自贡市","攀枝花市","泸州市","德阳市","广汉市","什邡市","绵竹市","绵阳市","江油市","广元市","遂宁市","内江市","隆昌市","乐山市","峨眉山市","南充市","阆中市","眉山市","宜宾市","广安市","华蓥市","达州市","万源市","雅安市","巴中市","资阳市","马尔康市","康定市","西昌市","贵阳市","清镇市","六盘水市","盘州市","遵义市","赤水市","仁怀市","安顺市","毕节市","铜仁市","兴义市","凯里市","都匀市","福泉市","昆明市","安宁市","曲靖市","宣威市","玉溪市","保山市","腾冲市","昭通市","丽江市","普洱市","临沧市","楚雄市","个旧市","开远市","蒙自市","弥勒市","文山市","景洪市","大理市","瑞丽市","芒市","泸水市","香格里拉市","拉萨市","日喀则市","昌都市","林芝市","山南市","西安市","铜川市","宝鸡市","咸阳市","兴平市","渭南市","韩城市","华阴市","延安市","汉中市","榆林市","神木市","安康市","商洛市","兰州市","嘉峪关市","金昌市","白银市","天水市","武威市","张掖市","平凉市","酒泉市","玉门市","敦煌市","庆阳市","定西市","陇南市","临夏市","合作市","西宁市","海东市","玉树市","格尔木市","德令哈市","银川市","灵武市","石嘴山市","吴忠市","青铜峡市","固原市","中卫市","乌鲁木齐市","新市","克拉玛依市","吐鲁番市","哈密市","昌吉市","阜康市","博乐市","阿拉山口市","库尔勒市","阿克苏市","阿图什市","喀什市","和田市","伊宁市","奎屯市","霍尔果斯市","塔城市","乌苏市","阿勒泰市","石河子市","阿拉尔市","图木舒克市","五家渠市","铁门关市","台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市"]


    //存放相同首字母的城市数组
//    var cityGroups = [String:[String]]()
    //存放所有地址首字母
//    var groupTitles = [String]()
    
    
    var cityGroups = ["Q": ["迁安市", "秦皇岛市", "齐齐哈尔市", "七台河市", "启东市", "衢州市", "泉州市", "青岛市", "栖霞市", "青州市", "曲阜市", "沁阳市", "潜江市", "清远市", "钦州市", "琼海市", "邛崃市", "清镇市", "曲靖市", "庆阳市", "青铜峡市"], "N": ["南宫市", "讷河市", "宁安市", "南京市", "南通市", "宁波市", "宁国市", "南安市", "南平市", "宁德市", "南昌市", "南阳市", "宁乡市", "南雄市", "南宁市", "内江市", "南充市"], "Z": ["遵化市", "涿州市", "张家口市", "扎兰屯市", "庄河市", "肇东市", "张家港市", "镇江市", "诸暨市", "舟山市", "漳州市", "漳平市", "樟树市", "淄博市", "枣庄市", "招远市", "诸城市", "邹城市", "郑州市", "周口市", "驻马店市", "枝江市", "枣阳市", "钟祥市", "株洲市", "张家界市", "资兴市", "珠海市", "湛江市", "肇庆市", "中山市", "自贡市", "资阳市", "遵义市", "昭通市", "张掖市", "中卫市"], "B": ["北京市", "保定市", "包头市", "巴彦淖尔市", "本溪市", "北镇市", "北票市", "白山市", "白城市", "北安市", "蚌埠市", "亳州市", "滨州市", "北海市", "北流市", "百色市", "巴中市", "毕节市", "保山市", "宝鸡市", "白银市", "博乐市"], "F": ["汾阳市", "丰镇市", "抚顺市", "凤城市", "阜新市", "扶余市", "富锦市", "抚远市", "阜阳市", "福州市", "福清市", "福安市", "福鼎市", "丰城市", "抚州市", "肥城市", "佛山市", "防城港市", "福泉市", "阜康市"], "G": ["高碑店市", "古交市", "高平市", "根河市", "盖州市", "公主岭市", "高邮市", "共青城市", "贵溪市", "赣州市", "高安市", "高密市", "巩义市", "广水市", "广州市", "高州市", "桂林市", "贵港市", "桂平市", "广汉市", "广元市", "广安市", "贵阳市", "个旧市", "格尔木市", "固原市", "高雄市"], "E": ["鄂尔多斯市", "额尔古纳市", "二连浩特市", "鄂州市", "恩施市", "恩平市", "峨眉山市"], "J": ["晋州市", "晋城市", "晋中市", "介休市", "锦州市", "吉林市", "蛟河市", "集安市", "鸡西市", "佳木斯市", "江阴市", "句容市", "靖江市", "建德市", "嘉兴市", "金华市", "江山市", "界首市", "晋江市", "建瓯市", "景德镇市", "九江市", "吉安市", "井冈山市", "济南市", "胶州市", "济宁市", "焦作市", "济源市", "荆门市", "荆州市", "津市市", "吉首市", "江门市", "揭阳市", "靖西市", "简阳市", "江油市", "景洪市", "嘉峪关市", "金昌市", "酒泉市", "基隆市", "嘉义市"], "S": ["石家庄市", "沙河市", "三河市", "深州市", "朔州市", "沈阳市", "舒兰市", "四平市", "双辽市", "松原市", "尚志市", "双鸭山市", "绥芬河市", "绥化市", "上海市", "苏州市", "宿迁市", "绍兴市", "嵊州市", "宿州市", "三明市", "石狮市", "邵武市", "上饶市", "寿光市", "三门峡市", "商丘市", "十堰市", "沙市", "石首市", "松滋市", "随州市", "韶山市", "邵阳市", "韶关市", "深圳市", "汕头市", "四会市", "汕尾市", "三亚市", "三沙市", "什邡市", "遂宁市", "山南市", "神木市", "商洛市", "石嘴山市", "石河子市"], "M": ["满洲里市", "梅河口市", "密山市", "牡丹江市", "穆棱市", "马鞍山市", "明光市", "孟州市", "麻城市", "汨罗市", "茂名市", "梅州市", "绵竹市", "绵阳市", "眉山市", "马尔康市", "蒙自市", "弥勒市", "芒市"], "P": ["平泉市", "泊头市", "盘锦市", "磐石市", "邳州市", "平湖市", "莆田市", "萍乡市", "平度市", "蓬莱市", "平顶山市", "濮阳市", "普宁市", "凭祥市", "彭州市", "攀枝花市", "盘州市", "普洱市", "平凉市"], "L": ["廊坊市", "潞城市", "临汾市", "吕梁市", "凌海市", "辽阳市", "凌源市", "辽源市", "临江市", "龙井市", "溧阳市", "连云港市", "乐清市", "兰溪市", "临海市", "丽水市", "龙泉市", "六安市", "龙海市", "龙岩市", "乐平市", "庐山市", "莱西市", "龙口市", "莱阳市", "莱州市", "莱芜市", "临沂市", "乐陵市", "聊城市", "临清市", "洛阳市", "林州市", "漯河市", "灵宝市", "老河口市", "利川市", "浏阳市", "醴陵市", "耒阳市", "临湘市", "娄底市", "冷水江市", "涟源市", "乐昌市", "廉江市", "雷州市", "陆丰市", "连州市", "罗定市", "柳州市", "来宾市", "泸州市", "隆昌市", "乐山市", "阆中市", "六盘水市", "丽江市", "临沧市", "泸水市", "拉萨市", "林芝市", "兰州市", "陇南市", "临夏市", "灵武市"], "R": ["任丘市", "如皋市", "瑞安市", "瑞昌市", "瑞金市", "荣成市", "乳山市", "日照市", "汝州市", "仁怀市", "瑞丽市", "日喀则市"], "C": ["承德市", "沧州市", "长治市", "赤峰市", "朝阳市", "长春市", "常州市", "常熟市", "慈溪市", "巢湖市", "滁州市", "池州市", "长乐市", "昌邑市", "长葛市", "赤壁市", "长沙市", "常宁市", "常德市", "郴州市", "潮州市", "岑溪市", "崇左市", "重庆市", "成都市", "崇州市", "赤水市", "楚雄市", "昌都市", "昌吉市"], "Y": ["阳泉市", "运城市", "永济市", "原平市", "牙克石市", "营口市", "榆树市", "延吉市", "伊春市", "宜兴市", "盐城市", "扬州市", "仪征市", "扬中市", "余姚市", "义乌市", "永康市", "玉环市", "永安市", "鹰潭市", "宜春市", "烟台市", "禹城市", "偃师市", "禹州市", "义马市", "永城市", "宜昌市", "宜都市", "宜城市", "应城市", "岳阳市", "益阳市", "沅江市", "永州市", "阳江市", "阳春市", "英德市", "云浮市", "玉林市", "宜宾市", "雅安市", "玉溪市", "延安市", "榆林市", "玉门市", "玉树市", "银川市", "伊宁市"], "D": ["定州市", "大同市", "大连市", "丹东市", "东港市", "大石桥市", "灯塔市", "调兵山市", "德惠市", "大安市", "敦化市", "大庆市", "东宁市", "东台市", "丹阳市", "东阳市", "德兴市", "东营市", "德州市", "登封市", "邓州市", "大冶市", "丹江口市", "当阳市", "东莞市", "东兴市", "儋州市", "东方市", "都江堰市", "德阳市", "达州市", "都匀市", "大理市", "敦煌市", "定西市", "德令哈市"], "A": ["安国市", "阿尔山市", "鞍山市", "安达市", "安庆市", "安丘市", "安阳市", "安陆市", "安顺市", "安宁市", "安康市", "阿拉山口市", "阿克苏市", "阿图什市", "阿勒泰市", "阿拉尔市"], "T": ["天津市", "唐山市", "太原市", "通辽市", "铁岭市", "通化市", "洮南市", "图们市", "铁力市", "同江市", "太仓市", "泰州市", "泰兴市", "桐乡市", "台州市", "铜陵市", "桐城市", "天长市", "滕州市", "泰安市", "天门市", "台山市", "铜仁市", "腾冲市", "铜川市", "天水市", "吐鲁番市", "塔城市", "图木舒克市", "铁门关市", "台北市", "台中市", "台南市"], "X": ["辛集市", "新乐市", "邢台市", "忻州市", "孝义市", "锡林浩特市", "新民市", "西市", "兴城市", "徐州市", "新沂市", "兴化市", "宣城市", "厦门市", "新余市", "新泰市", "荥阳市", "新密市", "新郑市", "新乡市", "许昌市", "信阳市", "项城市", "襄阳市", "孝感市", "咸宁市", "仙桃市", "湘潭市", "湘乡市", "信宜市", "兴宁市", "西昌市", "兴义市", "宣威市", "香格里拉市", "西安市", "咸阳市", "兴平市", "西宁市", "新市", "新竹市"], "W": ["武安市", "乌海市", "乌兰察布市", "乌兰浩特市", "瓦房店市", "五常市", "五大连池市", "无锡市", "温州市", "温岭市", "芜湖市", "武夷山市", "潍坊市", "威海市", "舞钢市", "卫辉市", "武汉市", "武穴市", "武冈市", "吴川市", "梧州市", "五指山市", "文昌市", "万宁市", "万源市", "文山市", "渭南市", "武威市", "吴忠市", "乌鲁木齐市", "乌苏市", "五家渠市"], "H": ["邯郸市", "黄骅市", "河间市", "衡水市", "河津市", "侯马市", "霍州市", "呼和浩特市", "霍林郭勒市", "呼伦贝尔市", "海城市", "葫芦岛市", "桦甸市", "珲春市", "和龙市", "哈尔滨市", "虎林市", "鹤岗市", "海林市", "黑河市", "海伦市", "海门市", "淮安市", "杭州市", "海宁市", "湖州市", "合肥市", "淮南市", "淮北市", "黄山市", "海阳市", "菏泽市", "鹤壁市", "辉县市", "黄石市", "汉川市", "洪湖市", "黄冈市", "衡阳市", "怀化市", "洪江市", "鹤山市", "化州市", "惠州市", "河源市", "贺州市", "河池市", "合山市", "海口市", "华蓥市", "韩城市", "华阴市", "汉中市", "合作市", "海东市", "哈密市", "和田市", "霍尔果斯市"], "K": ["开原市", "昆山市", "开封市", "开平市", "康定市", "凯里市", "昆明市", "开远市", "克拉玛依市", "库尔勒市", "喀什市", "奎屯市"], "搜索城市":[]]
    
    var cityTitles = ["A", "B", "C", "D", "E", "F", "G", "H", "J", "K", "L", "M", "N", "P", "Q", "R", "S", "T", "W", "X", "Y", "Z"]
    
    @Published var groupTitles = ["A", "B", "C", "D", "E", "F", "G", "H", "J", "K", "L", "M", "N", "P", "Q", "R", "S", "T", "W", "X", "Y", "Z"]
        
    @Published var searchMode = false
    
    func CityGroupInit(){
        //遍历城市数组
        for city in CityNames {
           //将城市名字转化成拼音
            var cityMutableString = NSMutableString(string: city);
                        
            cityMutableString = transformMandarinToLatin(cityMutableString: cityMutableString)
            
            //拿到拼音首字母作为key,并转化成大写
            let firstLetter = cityMutableString.substring(to: 1).uppercased()
            //NSLog("firstLetter = %@", firstLetter);
            //判断:检查是否存在以firstLetter为数组对应的分组存在,如果有就添加到对应的分组中,否则就新建一个以firstLetter为可以的数组
            if var value = cityGroups[firstLetter] {
                //存在,就添加
                value.append(city)
                cityGroups[firstLetter] = value
            }
            else
            {
                cityGroups[firstLetter] = [city]
            }

        }
    }
    
    func transformMandarinToLatin(cityMutableString : NSMutableString) -> NSMutableString {
            
        /*复制出一个可变的对象*/
        let preString :NSMutableString = NSMutableString(string: cityMutableString)
        
        //转换成成带音 调的拼音
        CFStringTransform(preString, nil, kCFStringTransformToLatin, false)
        //去掉音调
        CFStringTransform(preString, nil, kCFStringTransformStripDiacritics, false)
        
        NSLog("cityMutableString = %@", cityMutableString);
        
        if cityMutableString.substring(to: 1).compare("长") == ComparisonResult.orderedSame{
            preString.replaceCharacters(in: NSRange(location: 0,length: 5), with: "chang")
        }
        if cityMutableString.substring(to: 1).compare("沈") == ComparisonResult.orderedSame
        {
            preString.replaceCharacters(in: NSRange(location: 0,length: 4), with: "shen")
        }
        if cityMutableString.substring(to: 1).compare("厦") == ComparisonResult.orderedSame
        {
            preString.replaceCharacters(in: NSRange(location: 0,length: 4), with: "xia")
        }
        if cityMutableString.substring(to: 1).compare("地") == ComparisonResult.orderedSame
        {
            preString.replaceCharacters(in: NSRange(location: 0,length: 3), with: "di")
        }
        if cityMutableString.substring(to: 1).compare("重") == ComparisonResult.orderedSame
        {
            preString.replaceCharacters(in: NSRange(location: 0,length: 5), with: "chong")
        }
        
        return preString
    }

    func search(_ searchContent:String){
        if(searchContent != ""){
            groupTitles.removeAll()
            groupTitles.append("搜索城市")
            cityGroups["搜索城市"]?.removeAll()
            for city in CityNames {
                if(city.contains(searchContent)){
                    cityGroups["搜索城市"]?.append(city)
                }
            }
        }else{
            groupTitles.removeAll()
            groupTitles = cityTitles
        }
    }
    func back(){
        groupTitles.removeAll()
        groupTitles = cityTitles
    }
}
